anthropic.claude-code
christian-kohler.npm-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
golang.go
jonnyyu.chrome-app-devtools
marimo-team.vscode-marimo
mechatroner.rainbow-csv
mongodb.mongodb-vscode
monokai.theme-monokai-pro-vscode
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
necatiarslan.aws-s3-vscode-extension
redhat.vscode-yaml
rust-lang.rust-analyzer
tomoki1207.pdf
